БухЭксп/Documents/CW_УстановкаПараметровТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_УстановкаПараметровТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CW_ПараметрыТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УстанавливаемыеПараметрыТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеСоЗначениемПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрТранпортногоСредства</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтароеЗначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Documents/CW_УстановкаПараметровТС/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	CW_Документы.ЗаполнениеДокументов(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	CW_УчетСобственногоТранспортаСервер.ПодготовитьДвженияКПроведению(ЭтотОбъект);
	
	МассивИменРегистров = CW_УчетСобственногоТранспортаСервер.ПолучитьИспользуемыеРегистры(ЭтотОбъект);
	
	ДанныеДляПроведения = ПодготовитьДанныеДляПроведения(МассивИменРегистров);
	
	CW_УчетСобственногоТранспортаСервер.ЗарегистрироватьДвиженияДокумента(Движения,ДанныеДляПроведения,МассивИменРегистров);	
		
КонецПроцедуры

Функция ПодготовитьДанныеДляПроведения(МассивИменРегистров)
	
	ДанныеДляПроведения 		= CW_УчетСобственногоТранспортаСервер.ПодготовитьТаблицыДанныхДляПроведения(МассивИменРегистров);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ДействиеСоЗначениемПараметра", "Изменить");
	
	
	мОтобранныеСтроки =  УстанавливаемыеПараметрыТС.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаПараметров из мОтобранныеСтроки Цикл
		
		Если СтрокаПараметров.ПараметрТранпортногоСредства <> ПланыВидовХарактеристик.CW_ПараметрыТранспортныхСредств.РегистрационныйЗнак Тогда
			НоваяСтрокаПараметров 								= ДанныеДляПроведения.CW_ПараметрыТС.Добавить();
			НоваяСтрокаПараметров.Период 						= Дата;
			НоваяСтрокаПараметров.ТранспортноеСредство 			= ТранспортноеСредство;
			НоваяСтрокаПараметров.ПараметрТранпортногоСредства 	= СтрокаПараметров.ПараметрТранпортногоСредства;
			НоваяСтрокаПараметров.Значение 						= СтрокаПараметров.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеДляПроведения;
	
КонецФункции

#КонецЕсли
